[net]
batch=1
channels=3
height=384
width=576

[convolutional]
filters=32
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[maxpool]
size=2
stride=2

[route]
layers=-2

[convolutional]
filters=16
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[route]
layers=-4, -1

[convolutional]
filters=32
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=16
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=32
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=16
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=32
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=16
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=32
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=16
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=64
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=64
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=64
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=64
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=64
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=128
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=128
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=128
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[convolutional]
filters=128
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-3, -1

[route]
layers=-26

[convolutional]
filters=32
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=24
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-2

[convolutional]
filters=24
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=24
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-5

[convolutional]
filters=24
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=24
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=24
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-9, -8, -5, -1

[convolutional]
filters=48
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-24

[convolutional]
filters=64
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-2

[convolutional]
filters=32
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-5

[convolutional]
filters=32
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-9, -8, -5, -1

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-31

[convolutional]
filters=128
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=128
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers=-21

[convolutional]
filters=27
size=1
stride=1
pad=1
activation=linear

[yolo]
mask=0,1,2
anchors=8,2, 17,3, 34,6, 76,10, 49,24, 138,26, 94,88, 291,69, 406,199
classes=4
num=9

[route]
layers=-9

[convolutional]
filters=27
size=1
stride=1
pad=1
activation=linear

[yolo]
mask=3,4,5
anchors=8,2, 17,3, 34,6, 76,10, 49,24, 138,26, 94,88, 291,69, 406,199
classes=4
num=9

[route]
layers=-7

[convolutional]
filters=27
size=1
stride=1
pad=1
activation=linear

[yolo]
mask=6,7,8
anchors=8,2, 17,3, 34,6, 76,10, 49,24, 138,26, 94,88, 291,69, 406,199
classes=4
num=9